first_routes_n_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: User.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Alice Cooper"], ["updated_at", "2022-11-10 06:23:59.761773"], ["id", 1]]
---
  def update
    user = User.find_by(id: params[:id])
    if user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
  def destroy
    user = User.find_by(id: params[:id])
    if user.nil?
      raise "user not found"
    else
      user.destroy